const mainGroup = [
  '1.最多只能携带11名干员（包括助战位）\n2.最多可携带2名6星干员，3名5星干员\n3.全程保持2倍速，不能暂停',
  '1.最多可携带2名6星干员，4名5星干员\n2.全程保持2倍速，不能暂停',
  '1.最多可携带2名6星干员，5名5星干员\n2.全程保持2倍速，不能暂停'
]
const terms = [
  [
    "无法使用远近卫",
    "无法使用群攻干员",
    "无法使用【狙击干员】",
    "无法使用【重装干员】",
    "无法使用【医疗干员】",
    "无法主动撤退干员",
    "无法使用【特种干员】",
    "无法使用【术师干员】"
  ],
  [
    "必须携带企鹅物流的所有干员(能天使，德克萨斯，空，可颂)",
    "必须携带深海猎人的所有干员(斯卡蒂，幽灵鲨)",
    "必须携带使徒的所有干员(闪灵，夜莺，临光)",
    "必须携带黑钢的所有干员(雷蛇，芙兰卡，杰西卡，香草)",
    "必须携带莱茵生命的干员(塞雷娅，伊芙利特，麦哲伦，赫默，白面鸮，梅尔)（六选四）",
    "必须携带喀兰贸易的所有干员(银灰，崖心，初雪，讯使，角峰)"
  ],
  [
    "必须携带安洁莉娜且无法使用【三技能】",
    "必须携带能天使且无法使用【三技能】",
    "必须携带必须携带食铁兽/格拉尼/狮蝎（三选一）",
    "必须携带陈+星熊",
    "必须携带蓝毒+格劳克斯",
    "必须携带拉普兰德+德克萨斯",
    "必须携带阿米娅且只能使用【一技能】",
    "必须携带可颂+安洁莉娜",
    "必须携带银灰且无法使用【真银斩】",
    "必须携带调香师且无法使用【二技能】",
    "必须携带银灰+赫拉格",
    "必须携带送葬人+炎客",
    "必须携带黑+锡兰"
  ]
]
module.exports = function(content, callback) {
  callback(`主要条件：\n${mainGroup[~~(Math.random() * mainGroup.length)]}\n\n特殊条件：\n${terms.map(d => d[~~(Math.random() * d.length)]).join('\n')}`)
}